# Nurbs Surface Data Get Control Point Method

Source: https://www.revitapidocs.com/2026/d8a259a6-4ada-a397-b7a1-52ba6d742d11.htm

---

| Nurbs Surface Data Get Control Point Method |
| --- |

Get the list of control points.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public XYZ GetControlPoint(
	int idx
)
```

```
Public Function GetControlPoint (
	idx As Integer
) As XYZ
```

```
public:
XYZ^ GetControlPoint(
	int idx
)
```

```
member GetControlPoint :
        idx : int -> XYZ
```

#### Parameters

idx Int32
:   The index of the control point.

#### Return Value

XYZ Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | Out\-of\-range access. |

See Also

#### Reference

NurbsSurfaceData Class Autodesk.Revit.DB Namespace